Revit 2027 API
SpacingRuleLayout Enumeration
 Rules for laying out a series of equidistant points or parallel lines
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpacingRuleLayout
Public Enumeration SpacingRuleLayout
public enum class SpacingRuleLayout
type SpacingRuleLayout
Members
Member name | Value | Description
FixedDistance | 1 |  Points or lines are separated by a fixed distance.
FixedNumber | 2 |  Fixed number of points or lines with uniform distance between them.
MaximumSpacing | 3 |  Points or lines are separated by at most the max distance.
MinimumSpacing | 5 |  Points or lines are separated by at least the minimum distance.
None | 0 |  No points or lines will be created.
See Also
Reference
Autodesk.Revit.DB Namespace